gwerwerfwf/stm32f103zet6/智慧农业z(底层驱动)/智能大棚--2023模拟/hardware/LED.c
#include "stm32f10x.h"                  // Device header

void LED_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	GPIO_SetBits(GPIOA,GPIO_Pin_8);
	
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	GPIO_SetBits(GPIOB,GPIO_Pin_9);
	
}

void LED1_ON(void)
{
   GPIO_ResetBits(GPIOB,GPIO_Pin_9);
}

void LED1_OFF(void)
{
	GPIO_SetBits(GPIOB,GPIO_Pin_9);
}

void LED2_ON(void)
{
   GPIO_ResetBits(GPIOA,GPIO_Pin_8);
}

void LED2_OFF(void)
{
	GPIO_SetBits(GPIOA,GPIO_Pin_8);

}
